namespace Whistler.VehicleSystem
{
    public enum WindowID
    {
        WindowFrontRight,
        WindowFrontLeft,
        WindowRearRight,
        WindowRearLeft
    }

    public enum WindowState
    {
        WindowFixed,
        WindowDown,
        WindowBroken
    }

    public enum DoorID
    {
        DoorFrontLeft = 0,
        DoorFrontRight = 1,
        DoorRearLeft = 2,
        DoorRearRight = 3,
        DoorHood = 4,
        DoorTrunk = 5,
        DoorBack = 6,
        DoorBack2 = 7,
    }

    public enum DoorState
    {
        DoorClosed,
        DoorOpen,
    }

    public enum WheelID
    {
        Wheel0,
        Wheel1,
        Wheel2,
        Wheel3,
        Wheel4,
        Wheel5,
        Wheel6,
        Wheel7,
        Wheel8,
        Wheel9
    }

    public enum WheelState
    {
        WheelFixed,
        WheelBurst,
        WheelOnRim,
    }

    public enum ConvoyType
    {
        None,
        Vehicle,
        Helicopter
    }

    public enum VehicleAccess
    {
        Admin,
        Work,
        MatWars,
        MedKits,
        School,
        StartQuest,
        RoyalBattle,
        WorkTruck,
        WorkBus,
        DockLoader,
        TestDrive,
        WorkCarThief,
        Rent,
        WeedFarm,
        ShowRoom
    }

    public enum WorkType
    {
        Taxi = 3,
        Bus = 4,
        DockLoader = 7
    }

    public enum PropBuyStatus
    {
        Unknown = 0,
        Bought,
        Given,
        Roulette,
        Donate,
    }

    public enum AccessType
    {
        /// <summary>
        /// Блокировка авто
        /// </summary>
        LockedDoor,
        /// <summary>
        /// открытие дверей/капота
        /// </summary>
        OpenDoor,
        /// <summary>
        /// Открытие багажника
        /// </summary>
        OpenTrunk,
        /// <summary>
        /// запуск двигателя
        /// </summary>
        EngineChange,
        /// <summary>
        /// запуск двигателя
        /// </summary>
        Inventory,
        /// <summary>
        /// Тюнинг авто
        /// </summary>
        Tuning,
        /// <summary>
        /// Продажа за доллары
        /// </summary>
        SellDollars,
        /// <summary>
        /// Продажа за коины
        /// </summary>
        SellRouletteCar,
        /// <summary>
        /// Продажа за бесплатно
        /// </summary>
        SellZero,

    }
    public enum ModTypes
    {
        Spoilers = 0, //спойлер  +
        FrontBumper = 1, //передний бампер  +
        RearBumper = 2, //задний бампер
        SideSkirt = 3, //юбка +
        Exhaust = 4, //выхлоп +
        Frame = 5, //каркас безопасности +
        Grille = 6,//решетка радиатора +
        Hood = 7, //капот +
        Fender = 8, //крылья/зеркала
        RightFender = 9, //крышка багажника  +-
        Roof = 10, //крыша +
        Engine = 11, //двигатель +
        Brakes = 12, //тормоза +
        Transmission = 13, //трансмиссия +
        Horns = 14, //гудок +
        Suspension = 15, //высота подвески +
        Armor = 16, //броня +
        Turbo = 18, //турбо +
        Xenon = 22, //ксенон +-
        FrontWheels = 23, //колеса +-
        BackWheels = 24, //задние колеса (мото и некоторые авто)  +-
        Plateholders = 25, //расположение переднего номера?? 
        VanityPlates = 26, //??радиатор
        TrimDesign = 27, //надпись на лобовухе +
        Ornaments = 28, //игрушка на торпеде
        Cabin = 29, //салон +
        DialDesign = 30, //торпеда +
        DoorDesign = 31, //карты дверей
        Seats = 32, //сиденья +
        SteeringWheel = 33, //руль +
        ShiftLever = 34, //игрушка КПП на руле
        Plaques = 35, //надпись за задним стеклом
        Speakers = 36, //задние динамики / всякая хрень сзади +
        Trunk = 37, //динамики в багажнике +
        Hydraulics = 38, //баллоны гидравлики в багажнике
        EngineBlock = 39, //Двигатель (внешний вид)
        AirFilter = 40, // фильтр двигателя (внешний вид) +
        Struts = 41, // распорка +
        ArchCover = 42, //фары
        Aerials = 43, //Замки капота
        Trim = 44, //воздухозаборник +
        WindowsTypes = 46, //окна
        Livery = 48,  //винилы +
        LiveryTwo = 50, //вариация раскраски авто
        WheelsColor = 51, //Цвет дисков
        WheelsType = 52, //тип дисков
        NumberType = 53, //рамка номера +
        PearlColor = 54, //перламутр +
        WindowToning = 55, //тонировка +
    }

    public enum HandlingKeys
    {
        //Physics params
        //handlingName = 0, //параметр, отвечающий за название транспортного средства в игре (макс. 14 прописных букв, может также содержать цифры);
        fMass = 1, //параметр, отвечающий за массу транспортного средства в килограммах. (от 0.0 до 10000.0 и более);
        fInitialDragCoeff = 2, //начальный коэффициент аэродинамического сопротивления (от 0 до 120);
        //fPercentSubmerged = 3, //процент от высоты транспортного средства в воде, при котором оно начинает «плыть», погружаясь затем в воду. (любое значение с плавающей точкой, например 0.85 - равно 85 %).
        //vecCentreOfMassOffset = 4, //координаты x, y, z, отвечающие за вектор центра массы (от -10.0 до 10.0);x - положительное значение смещает центр тяжести вправо.y - положительное значение смещает центр тяжести вперед.z - положительное значение смещает центр тяжести вверх.
        //vecInertiaMultiplier = 5, //координаты x, y, z, отвечающие за множитель вектора инерции (от -10. до 10.0);


        //TransmissionParams
        fDriveBiasFront = 6, //параметр, отвечающий за привод транспортного средства. Так, значение 0.0 определяет заднеприводный транспорт; 1.0, //переднеприводный; 0.5, //полноприводный транспорт (на 4 колеса).
        nInitialDriveGears = 7, //параметр, отвечающий за количество передач (от 1 до 16);
        fInitialDriveForce = 8, //множитель тягового усиления (ускорение) транспортного средства (от 0.01 до 2.0. Значение 1.0 не влияет на множитель.);
        fDriveInertia = 9, //множитель, отвечающий за инерцию двигателя (за то, как быстро набираются обороты, от 0.01 до 2.0. Значение 1.0 не влияет на множитель.);
        fClutchChangeRateScaleUpShift = 10, //множитель сцепления при смещении вверх;
        fClutchChangeRateScaleDownShift = 11, //множитель сцепления при смещении вниз;
        fInitialDriveMaxFlatVel = 12, //теоретическая максимальная скорость транспортного средства в км/ч (от 0.00 до 500.0 и более. Изменение данного значения не гарантирует достижение этой скорости); Умножьте значение из файла на 0.82 чтобы получить скорость в миля/час Умножьте значение из файла на 1.32 чтобы получить скорость в км/час
        fBrakeForce = 13, //множитель силы торможения транспортного средства (от 0.01 до 2.0. Значение 1.0 не влияет на множитель);
        fBrakeBiasFront = 14, //параметр, отвечающий за равномерное распределение силы торможения между передней и задней осей (от 0.0 до 1.0. Значение 0.0 увеличивает силу торможения только для задней оси; 1.0, //для передней оси; 0.5, //равномерно. В жизни, автомобили как правила имеют более высокую силу торможения передней оси, например 0.65);
        fHandBrakeForce = 15, //параметр, отвечающий за мощность ручного тормоза транспортного средства;
        fSteeringLock = 16, //множитель максимального угла поворота руля (от 0.01 до 2.0. Значение в радиусе 0.1, //0.2 сымитирует транспорт с удлиненной колесной базой. Высокое значение данного параметра приведет к заносу);


        //Transmissions
        fTractionCurveMax = 17, //параметр, отвечающий за сцепление колес на повороте;
        fTractionCurveMin = 18, //параметр, отвечающий за пробуксовку колес;
        fTractionCurveLateral = 19, //параметр, отвечающий за боковую силу сцепления;
        fTractionSpringDeltaMax = 20, //параметр, отвечающий за расстояние от земли, при котором транспортное средство теряет сцепление;
        fLowSpeedTractionLossMult = 21, //параметр, отвечающий за силу сцепления транспортного средства при низкой скорости (значение 0.0, //исходная сила сцепления);
        //fCamberStiffnesss = 22, //параметр, отвечающий за угол развала колес у мотоциклов;
        fTractionBiasFront = 23, //параметр, отвечающий за распределение тяги между передними и задними колесами (от 0.01 до 0.99);
        fTractionLossMult = 24, //параметр, отвечающий за потерю сцепления шины с дорогой;


        //Suspensions
        fSuspensionForce = 25, //(1 / сила * количество колес), //нижний предел силы при полном выдвижении (сила подвески);
        fSuspensionCompDamp = 26, //параметр, отвечающий за силу и интенсивность вибрации подвески;
        fSuspensionReboundDamp = 27, //параметр, отвечающий за силу и интенсивность вибрации подвески на высоких скоростях;
        fSuspensionUpperLimit = 28, //(визуально) максимальная высота кузова транспортного средства;
        fSuspensionLowerLimit = 29, //(визуально) минимальная высота кузова транспортного средства;
        fSuspensionRaise = 30, //параметр, отвечающий за высоту подвески;
        fSuspensionBiasFront = 31, //параметр, отвечающий за смещение подвески вперед (большое значение подходит для грузовиков);
        fAntiRollBarForce = 32, //параметр, отвечающий за силу стабилизатора подвески;
        fAntiRollBarBiasFront = 33, //параметр, отвечающий за смещение силы стабилизатора подвески вперед;
        fRollCentreHeightFront = 34, //параметр, отвечающий за высоту центра крена;
        fRollCentreHeightRear = 35, //параметр, отвечающий за высоту центра крена;


        //Damage
        //fCollisionDamageMult = 36, //множитель урона от столкновения (от 0.0 до 10.0. Значение 0.0 означает нулевой урон, 10.0, //десятикратный урон);
        //fWeaponDamageMult = 37, //множитель урона от оружия (от 0.0 до 10.0. Значение 0.0 означает нулевой урон, 10.0, //десятикратный урон);
        //fDeformationDamageMult = 38, //множитель урона от деформации (от 0.0 до 10.0. Значение 0.0 означает нулевой урон, 10.0, //десятикратный урон с последующей поломкой);
        //fEngineDamageMult = 39, //множитель урона, получаемого двигателем. Может привести к взрыву или выходу из строя;
        //fPetrolTankVolume = 40, //параметр, отвечающий за количество топлива вытыкаемого после выстрела по бензобаку;
        //fOilVolume = 41, //параметр, отвечающий за уровень масла/черный дым?;


        //Other
        //fSeatOffsetDistX = 42, //координаты расстояния от двери до сидения;
        //fSeatOffsetDistY = 43, //координаты расстояния от двери до сидения;
        //fSeatOffsetDistZ = 44, //координаты расстояния от двери до сидения;
        //nMonetaryValue = 45, //стоимость транспортного средства;
        //strModelFlags = 46, //флаги модели. Самая правая значащая цифра является первой:


        ReduceGrip = 999, //Стабилизация ТС
    }
}
